
def likes(s):
 a = ("'Никто не оценил данную запись'",
 "f'{s[0]} оценил(а) данную запись'",
 "f'{s[0]} и {s[1]} оценили данную запись'",
 "f'{s[0]}, {s[1]} и {s[2]} оценили данную запись'",
 "f'{s[0]}, {s[1]} и {len(s) - 2} других оценили данную запись'")
 return  eval(a[len(s)]) if len(s)<=4 else eval(a[4])



print(likes([]))
print(likes(['Тимур']))
print(likes(['Тимур', 'Артур']))
print(likes(['Тимур', 'Артур', 'Руслан']))
print(likes(['Тимур', 'Артур', 'Руслан', 'Анри']))
print(likes(['Тимур', 'Артур', 'Руслан', 'Анри', 'Дима']))
print(likes(['Тимур', 'Артур', 'Руслан', 'Анри', 'Дима', 'Рома', 'Гвидо', 'Марк']))